package test;
/*  1. Напишите программу, которая выводит числа от 1 до 100;
2. Напишите программу которая генерируент 25 случайных значений типа int
Для каждого значения команда if-else сообщает в каком отношении оно находится
с друим случайно сгенерированным числом (больше меньше равно);
3. Измените упражнение 2 так, что бы код выполнения выполнялся в бесконечном цикле While.
Программа должна работать до тех пор, пока её выполнение не будет прервано с клавиатуры(CTRL + C);
4. Напишите программу, использующую два вложенных цикла for и оператор остатка % для поиска и вывода простых чисел
то есть целых чисел, не делящихся нацело и на какое другое число кроме себя и 1
5. Повторите управжнение один */


import java.util.Date;
import java.util.Random;

public class zada4ki {

 zada4ki(String j) {
     System.out.println("Zada4ki " + j + " ");
 }



    public static void main(String[] args) {


        System.out.println(new Date() );

  //      for (int i = 0; i <100 ; i++) {
     //       if (i==99) break;
    //        else System.out.println(i);
        }

        // for (int i = 1; i <= 100; i++) {
        //   System.out.println(i);



 /*       Random random = new Random();
         int xh = 1;
        for (int s = 0; s < 25 ; s++) {
           while(xh> 0) {
            int x = random.nextInt(100);
            int y = random.nextInt(100);

            if (x > y)
                System.out.println(x + " > " + y);
            else System.out.println(x + " < " + y);
            if (x == y)
                System.out.println(x + " = " + y);
        }



     boolean flag = true;
        for (int i = 2; i < 1000 ; i++) {
            for (int j = 2; j < i; j++) {
                if (i%j==0)
                {flag=false;
                    break;}}
            if (flag) System.out.println(i);flag = true;}

*/


}


